nextflow_q_para_cluster/casedir/constant/InjectorModel
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "constant";
 object injectionModel;
}

injector1
{
  type coneInjection;
  SOI 0;
  massTotal 0.095;
  parcelBasisType mass; 	// self adjusting via rho?
  injectionMethod disc;
  flowType constantVelocity;
  Umag 3;
  flowRateProfile constant       1 ;
  dInner 0;
  dOuter 0.01;
  duration 3;
  position (0.5 0.6 1.0);
  direction (0.0 -1.0 0.0);
  parcelsPerSecond 57000;
  nParticle 1;
  thetaInner constant       0.0 ;
  thetaOuter constant       40.0 ;
  sizeDistribution
  {
    type RosinRammler;
    RosinRammlerDistribution
    {
      minValue 0.00015;
      maxValue 0.0005;
      d 0.0003;
      n 2.4;
    }
  }
}

