nextflow_q_para_cluster/casedir/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     MPPICFoam;

startFrom       startTime;

startTime       0.0;

stopAt          endTime;

endTime         5;

deltaT          1e-2;

writeControl    adjustableRunTime;

writeInterval   2.5e-1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

adjustTimeStep  yes;

maxCo           0.5;

runTimeModifiable yes;

// ************************************************************************* //
